practice_030_leetcode_weekly_contest_308.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practice #030: Leetcode Weekly Contest 308</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Practice #030: Leetcode Weekly Contest 308</h1>

<div id="outline-container-org9528f61" class="outline-2">
<h2 id="org9528f61">Leetcode: 2389. Longest Subsequence With Limited Sum</h2>
<div class="outline-text-2" id="text-org9528f61">
<p>
<a href="https://leetcode.com/problems/longest-subsequence-with-limited-sum/">Problem Statement</a>
</p>

<dl class="org-dl">
<dt>Category</dt><dd><a href="binary_search.html#ID-1217FC3D-A9F9-49EC-BA5D-A68E50338DBD">Binary-search</a></dd>
</dl>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> itertools <span style="font-weight: bold;">import</span> accumulate
<span style="font-weight: bold;">from</span> bisect <span style="font-weight: bold;">import</span> bisect_right


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">answerQueries</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>], queries: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        nums.sort()
        p = <span style="font-weight: bold;">list</span>(accumulate(nums))
        <span style="font-weight: bold;">return</span> [bisect_right(p, q) <span style="font-weight: bold;">for</span> q <span style="font-weight: bold;">in</span> queries]


<span style="font-weight: bold;">assert</span> Solution().answerQueries([4, 5, 2, 1], [3, 10, 21]) == [2, 3, 4]
<span style="font-weight: bold;">assert</span> Solution().answerQueries([2, 3, 4, 5], [1]) == [0]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4ae2b5" class="outline-2">
<h2 id="orgf4ae2b5">Leetcode: 2390. Removing Stars From a String</h2>
<div class="outline-text-2" id="text-orgf4ae2b5">
<p>
<a href="https://leetcode.com/problems/removing-stars-from-a-string/">Problem Statement</a>
</p>

<dl class="org-dl">
<dt>Category</dt><dd><a href="stack.html#ID-06D27BC1-DFDC-4063-B3A9-7074FD5E13B3">Stack</a></dd>
</dl>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">removeStars</span>(<span style="font-weight: bold;">self</span>, s: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">str</span>:
        st = []
        <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> s:
            <span style="font-weight: bold;">if</span> c == <span style="font-style: italic;">"*"</span>:
                st.pop()
            <span style="font-weight: bold;">else</span>:
                st.append(c)
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">""</span>.join(st)


<span style="font-weight: bold;">assert</span> Solution().removeStars(<span style="font-style: italic;">"leet**cod*e"</span>) == <span style="font-style: italic;">"lecoe"</span>
<span style="font-weight: bold;">assert</span> Solution().removeStars(<span style="font-style: italic;">"erase*****"</span>) == <span style="font-style: italic;">""</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1896857" class="outline-2">
<h2 id="org1896857">Leetcode: 2391. Minimum Amount of Time to Collect Garbage</h2>
<div class="outline-text-2" id="text-org1896857">
<p>
<a href="https://leetcode.com/problems/minimum-amount-of-time-to-collect-garbage/">Problem Statement</a>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> itertools <span style="font-weight: bold;">import</span> accumulate
<span style="font-weight: bold;">from</span> collections <span style="font-weight: bold;">import</span> defaultdict


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">garbageCollection</span>(<span style="font-weight: bold;">self</span>, garbage: List[<span style="font-weight: bold;">str</span>], travel: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        ans = 0
        <span style="font-weight: bold; font-style: italic;">d</span> = defaultdict(<span style="font-weight: bold;">int</span>)
        <span style="font-weight: bold; font-style: italic;">p</span> = <span style="font-weight: bold;">list</span>(accumulate([0] + travel))
        <span style="font-weight: bold;">for</span> j, g <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(garbage):
            <span style="font-weight: bold; font-style: italic;">ans</span> += <span style="font-weight: bold;">len</span>(g)
            <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">g</span>:
                d[<span style="font-weight: bold; font-style: italic;">i</span>] = <span style="font-weight: bold;">max</span>(d[i], j)
        <span style="font-weight: bold; font-style: italic;">ans</span> += <span style="font-weight: bold;">sum</span>(p[i] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> d.values())
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().garbageCollection([<span style="font-style: italic;">"G"</span>, <span style="font-style: italic;">"P"</span>, <span style="font-style: italic;">"GP"</span>, <span style="font-style: italic;">"GG"</span>], [2, 4, 3]) == 21
<span style="font-weight: bold;">assert</span> Solution().garbageCollection([<span style="font-style: italic;">"MMM"</span>, <span style="font-style: italic;">"PGM"</span>, <span style="font-style: italic;">"GP"</span>], [3, 10]) == 37
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e5b536" class="outline-2">
<h2 id="org7e5b536">Leetcode: 2392. Build a Matrix With Conditions</h2>
<div class="outline-text-2" id="text-org7e5b536">
<p>
<a href="https://leetcode.com/problems/build-a-matrix-with-conditions/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="is_there_an_alternative_problem_easier_to_solve.html#ID-64E7E55B-09A9-4022-AB5E-1D25FC64EAC9">Is there an alternative problem easier to solve?</a>  Build two graphs for rows and columns conditions where each condition is an edge between two numbers from \(1\) to \(k\).  The problem becomes finding the <a href="topological_sort.html#ID-80122A2F-3B84-48B1-B10D-6ACEE4373298">Topological Sort</a> of these two graphs and filled the final matrix with it.  Time and space complexity are \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">topological_sort</span>(<span style="font-weight: bold;">self</span>, graph):
        NOT_VISITED = 1
        <span style="font-weight: bold; font-style: italic;">OPEN</span> = 2
        <span style="font-weight: bold; font-style: italic;">CLOSED</span> = 4

        <span style="font-weight: bold; font-style: italic;">status</span> = {<span style="font-weight: bold; font-style: italic;">u</span>: NOT_VISITED <span style="font-weight: bold;">for</span> u <span style="font-weight: bold;">in</span> graph}
        ans = []

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(u):
            <span style="font-weight: bold;">if</span> status[u] == CLOSED:
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>
            <span style="font-weight: bold;">if</span> status[u] == OPEN:
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>

            status[u] = OPEN
            <span style="font-weight: bold;">for</span> v <span style="font-weight: bold;">in</span> graph[u]:
                <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> dfs(v):
                    <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>

            ans.append(u)
            status[u] = CLOSED
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>

        <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> status:
            <span style="font-weight: bold;">if</span> status[c] == NOT_VISITED:
                <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> dfs(c):
                    <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>

        ans.reverse()
        <span style="font-weight: bold;">return</span> ans

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">buildMatrix</span>(
        <span style="font-weight: bold;">self</span>, k: <span style="font-weight: bold;">int</span>, rowConditions: List[List[<span style="font-weight: bold;">int</span>]], colConditions: List[List[<span style="font-weight: bold;">int</span>]]
    ) -&gt; List[List[<span style="font-weight: bold;">int</span>]]:
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">build_graph</span>(edges):
            A = {i: [] <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, k + 1)}
            <span style="font-weight: bold;">for</span> u, v <span style="font-weight: bold;">in</span> edges:
                A[u].append(v)
            <span style="font-weight: bold;">return</span> A

        r = <span style="font-weight: bold;">self</span>.topological_sort(build_graph(rowConditions))
        c = <span style="font-weight: bold;">self</span>.topological_sort(build_graph(colConditions))
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> r <span style="font-weight: bold;">or</span> <span style="font-weight: bold;">not</span> c:
            <span style="font-weight: bold;">return</span> []

        ans = [[0] * k <span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(k)]
        <span style="font-weight: bold;">for</span> e <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, k + 1):
            <span style="font-weight: bold;">if</span> e <span style="font-weight: bold;">in</span> r <span style="font-weight: bold;">and</span> e <span style="font-weight: bold;">in</span> c:
                ans[r.index(e)][c.index(e)] = e
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().buildMatrix(3, [[1, 2], [3, 2]], [[2, 1], [3, 2]]) == [
    [3, 0, 0],
    [0, 0, 1],
    [0, 2, 0],
]
<span style="font-weight: bold;">assert</span> Solution().buildMatrix(3, [[1, 2], [2, 3], [3, 1], [2, 3]], [[2, 1]]) == []
</pre>
</div>
</div>
</div>
</div>
</body>
</html>